# PenLoc

## Description
Returns the current coordinate location of the graphics pen.&lt;BR&gt;

```pascal
PROCEDURE PenLoc(VAR p : REAL);
```

```python

def vs.PenLoc():
    return p
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p|REAL|The current location of the graphics pen.|

## Examples
```pascal
PenLoc(theXCoord,theYCoord);

```

## Version
Availability: from MiniCAD
## Category
* Command